""" def alt(jahre):
    print(f"bist du {jahre}")

alt(18)
alt(52)
 """

"""  import time

print("На іншу любов, іншу любов")
time.sleep(4)
print("Сльози всі вже пролито")
time.sleep(3)
print("На іншу любов, іншу любов")
time.sleep(2)
print("Сльози всі вже пролито, о-о")
 """ 

""" import random
namber = random.randint(1, 43)
print("zeil ist", namber) """


""" import time

print("Мы выросли там где нет нормы морали")
time.sleep(0.3)
print("По спирали вниз, над нами стая птиц кружит")
time.sleep(3)
print("И я прошу не вспоминай меня пока я здесь, пока я еще жив")
 """


""" import time
import random
namber = random.randint(1, 19)
def untericht(lernen):
    print(f"в мене {lernen}",)

untericht(namber)
time.sleep(3)
untericht("матиматика")  """




# Введення (отримання даних)
""" vlados = input("Введіть ваше ім'я: ")

# Перетворення (обробка даних)
hallo = (f"Привіт, {vlados}!")

# Виведення (виведення даних)
print(hallo) """


""" begrüsung = input("Введіть ваше ім'я: ")

hallo = (f"Hallo schon mit dir kennen zu lehrnen {begrüsung}")

print(hallo) """


""" import time

namber = input("Write down the number: ")

namber_teip = (f"Thank you for the number {namber}")

print(namber_teip) """

""" name = input("name: ")

hello = (f"hallo { Тут можна використовувати функцію }")
print(hello) """

""" mein_name = input("Введи своє ім’я: ")
mein_age = int(input("Введи свій вік: "))   # переводимо у число
wird = "Через 5 років"
age_5 = mein_age + 5

print(f"Привіт, {mein_name}! Тобі {mein_age} років.")
print(f"{wird} тобі буде {age_5}.")
 """

""" text = "Привіт, Владислав!"

print(len(text))          # довжина рядка
print(text.upper())       # ВЕЛИКІ букви
print(text.lower())       # маленькі букви 
print(text.replace("Владислав", "Python"))  # заміна частини рядка
print(text[0])            # доступ до символу
print(text[-1])           # останній символ
print(text[0:7])          # зріз (від 0 до 5 індексу)
print(text.startswith("Привіт"))  # True перевіряє, чи рядок починається з вказаного слова
print(text.endswith("!"))         # True endswith("!") → перевіряє, чи рядок закінчується на вказаний символ
print("Влад" in text)     # True Оператор in → перевіряє, чи підрядок входить у рядок. Якщо "Влад" є в text, то результат True.
"""

""" numbers = [10, 20, 30, 40]

print(numbers[0])      # 10
numbers.append(50)     # додає елемент
numbers.remove(20)     # видаляє елемент
print(len(numbers))    # довжина списку
print(numbers[::-1])   # розворот
print(len(numbers))
numbers.remove(20) # не може мати 2 обєкта і копією з одинаковим числом
numbers.append(11)
numbers.append(88)
numbers.append(48)
numbers.remove(30)
print(numbers)  """

""" coords = (10, 20)
print(coords[0])   # 10
"""

""" fruits = {"яблуко", "банан", "яблуко"}

fruits.add("груша")# add слово додає
fruits.add("чай")
fruits.remove("яблуко")
print(fruits)    """


""" student = {
    "name": "Влад",
    "age": 17,
    "grade": "A",
    "sistem_generation": ""
}

print(student["name"])          # Влад
student["age"] = 18             # зміна
print(student.keys())           # усі ключі
print(student.values())         # усі значення
student["grade"] = ("ahahhahahhahha")
student["sistem_generation"] = "I feel very good."
print(student["sistem_generation"]) """

""" sentence = "Я люблю Python і програмування"
words = sentence.split()       # розбити рядок на список
print(words)                   # ['Я', 'люблю', 'Python', 'і', 'програмування']

joined = " ".join(words)       # зібрати назад у рядок
print(joined)                  # Я люблю Python і програмування 
 """
""" user_text = input("user: ")
user = "admin"
user_guest = "guest"

if user_text == user:
    print("Доступ дозволено")
elif user_text == user_guest: # == Перевіряє чи мають обидві змінні однаковий зміст
    print("Обмежений доступ")
else:                         # is Перевіряє чи це той самий 
    print("Доступ заборонено") #обєкт (одна й та сама коробка в памяті)?
 """
""" from tkinter import *
root = Tk()

root.title("window")
root.mainloop()

from tkinter import *

root = Tk()
root.title("Window")
 """

# приклад шаблону
# Щоб перевірити щось в input можна просто використати текст якій потрібен 
# наприклад як в цьому випадку gest і можна перевіряти
# чи є пуста строчка в воду  якщо там нічого не треба 
""" user = input("Введіть ім'я: ")
password = input("Введіть пароль: ")
gest = "gest"

if user is "admin" and password == "python123":
    print("Доступ дозволено")

elif user == "gest" and password == "":
    print("доступ обмежений")

else:
    print("Неправильне ім’я або пароль") """


""" 💡 ТЗ: Перевірка температури та пори року

Напиши програму, яка запитує температуру (число) і пору року (зима, літо, осінь, весна).
Виведи:
"Холодно" якщо температура нижче 10 або це зима
"Тепло" якщо температура більше 20 і це літо
"Прохолодно" якщо температура між 10 і 20
Інакше — "Невизначено"
💬 Підказка: Використай if, elif, else, and, or. """
""" 
time = int(input("температура: "))

if time < 10:
    print("Холодно")
elif time > 20:
    print("Тепло")
elif time >= 10 or 20:
    print("Прохолодно")
else:
    print("Невизначено") """


""" namber = int(input("nambers: "))

lange = len(str(namber))
if lange == 3 and namber % 2 == 0:
    print("erorr") """