""" Завдання:
Запроси в користувача два числа та дію (+, -, *, /).
Якщо дія не одна з цих чотирьох — виведи "Невідома операція".
Інакше обчисли результат і виведи.

Підказка:
Комбінуй if, elif, else. """
""" nambers1 = int(input("my nambers1: "))
nambers_maiking = input("(+, -, *, /): ")
nambers = int(input("my nambers2: "))

if nambers_maiking == "+":
    print("namber =", nambers1 + nambers)
elif nambers_maiking == "-":
    print("nambers =", nambers1 - nambers)
elif nambers_maiking == "*":
    print("nambers =", nambers1 * nambers)
elif nambers_maiking == "/":
       if nambers == 0:
        print("Помилка: ділення на нуль!")
       else:
        print("nambers =", nambers1 / nambers)
else:
    print("EROR") """ 
""" 🧩 1. Проверка пароля и имени

Задание:
Напиши программу, которая:
спрашивает имя и пароль,
даёт доступ только если:
имя — "admin" и пароль — "12345",
иначе выводит сообщение об ошибке.
Если имя "guest" или "test", то выводи: "Ограниченный доступ".
Если имя пустое — напиши "Ошибка: имя не указано!".
📘 Подсказка:
Используй and, or, not, if, elif, else. """
""" 
name = input("імя: ")
key = input("пароль: ")

if name == "admin" and key == "12345":
    print ("повний доступ")
elif name == "guest" or "test" and key == "":
    print("Ограниченный доступ")
else:
    print("Ошибка: имя не указано") """



""" ⚙️ 2. Проверка температуры
Задание:
Пользователь вводит температуру на улице.
Если температура больше 25 и меньше 35, вывести "Тепло".
Если меньше 0, вывести "Мороз".
Если не холодно и не жарко (например, от 10 до 25), вывести "Нормально".
В других случаях — "Незвичні погодні умови".
📘 Подсказка:
Используй комбинации and, or, not. """

""" tim_lid = {
    "timlid_name": "timur",
    "timlid_age": 17,
    "timlid_funktion": "зєднати команду"
}
print(tim_lid.keys())

 """

""" # Задаємо конкретне число
num = int(input("nambers:"))

# Перевіряємо кратність
if num % 3 == 0 and num % 5 == 0:
    print("FizzBuzz") 
elif num % 3 == 0:
    print("Fizz")
elif num % 5 == 0:
    print("Buzz")
else:
    print(num)
 """
""" 
🧩 ТЗ №1 — Вік користувача

Завдання:
Запроси в користувача вік.
Якщо йому більше або дорівнює 18 → "Доступ дозволено".
Якщо менше 18, але є дозвіл батьків (True) → "Доступ дозволено з дозволом".
Інакше → "Доступ заборонено".
Підказка: використай if age >= 18 or parent_permission == True. """

""" 
user_age = int(input("age: "))

if user_age >= 18 :
    print("Доступ дозволено")
elif user_age < 18:
    print("Доступ дозволено з дозволом")
elif user_age == 0:
    print("подайте дані")
    if user_age == -0:
        print("не можливо")
elif user_age >= 100:
    print("подайте дані")
else:
    print(None)  """

""" user_age = int(input("age: "))
parent_permission = input("Є дозвіл батьків? (yes/no): ")

if user_age == 0:
    print("Подайте справжні дані")
elif user_age >= 100:
    print("Неправильний вік")
elif user_age >= 18:
    print("Доступ дозволено")
elif user_age < 18 and parent_permission == "yes":
    print("Доступ дозволено з дозволом")
else:
    print("Доступ заборонено")
 """

""" if x >= 0:
    if y >= 0:  # x > 0, y > 0
        print("Перша чверть")
    else:  # x > 0, y < 0
        print("Четверта чверть")
else:
    if y >= 0:  # x < 0, y > 0
        print("Друга чверть")
    else:  # x < 0, y < 0
        print("Третя чверть")

 """
""" tex = input("tex: ")
msg = "Не було повернено даних"
if not  tex:# якщо воно являється пустишкою за того що not прямо 
    print(msg)# каже якщо в компоненті tex є none то print = "Не було повернено даних" """

fruit = "apple"

match fruit:
    case "apple":
        print("This is an apple.")
    case "banana":
        print("This is a banana.")
    case "orange":
        print("This is an orange.")
    case _:
        print("Unknown fruit.")
